ahmadawais.shades-of-purple-7.3.2
astro-build.astro-vscode-2.15.4-darwin-x64
beardedbear.beardedicons-1.18.0
beardedbear.beardedtheme-10.1.0
bmewburn.vscode-intelephense-client-1.12.6
bmewburn.vscode-intelephense-client-1.14.4
christian-kohler.path-intellisense-2.10.0
codium.codium-0.14.1
davidanson.vscode-markdownlint-0.60.0
dbaeumer.vscode-eslint-3.0.10
deque-systems.vscode-axe-linter-4.10.8
devsense.intelli-php-vscode-0.12.15062-darwin-x64
eamodio.gitlens-16.2.1
eamodio.gitlens-17.2.1-universal
ecmel.vscode-html-css-2.0.13
edwinhuish.better-comments-next-3.3.30
edwinhuish.better-comments-next-3.4.3
eliverlara.andromeda-1.8.2
esbenp.prettier-vscode-11.0.0
formulahendry.auto-close-tag-0.5.15
formulahendry.auto-rename-tag-0.1.10
github.vscode-pull-request-github-0.100.3
github.vscode-pull-request-github-0.102.0
github.vscode-pull-request-github-0.98.0
graphql.vscode-graphql-syntax-1.3.8
ikappas.phpcs-1.0.5
johnbillion.vscode-wordpress-hooks-1.6.0
johnpapa.vscode-peacock-4.2.2
josee9988.minifyall-2.10.0
killalau.vscode-liquid-snippets-2.0.3
kisstkondoros.vscode-gutter-preview-0.32.2
mechatroner.rainbow-csv-3.15.1
mechatroner.rainbow-csv-3.19.0
monokai.theme-monokai-pro-vscode-2.0.7
ms-azuretools.vscode-docker-2.0.0
ms-python.debugpy-2025.8.0-darwin-x64
ms-python.python-2025.6.1-darwin-x64
ms-python.vscode-pylance-2024.8.1
naumovs.color-highlight-2.8.0
obliviousharmony.vscode-php-codesniffer-3.0.2
oderwat.indent-rainbow-8.3.1
oouo-diogo-perdigao.docthis-0.8.2
redhat.vscode-yaml-1.18.0
richie5um2.vscode-sort-json-1.20.0
ritwickdey.liveserver-5.7.9
ronnidc.nunjucks-0.3.1
rvest.vs-code-prettier-eslint-6.0.0
shd101wyy.markdown-preview-enhanced-0.8.15
shd101wyy.markdown-preview-enhanced-0.8.18
shopify.theme-check-vscode-3.5.1
shopify.theme-check-vscode-3.9.7-universal
sleistner.vscode-fileutils-3.10.3
specstory.specstory-vscode-0.12.0
stoildobreff.php-resolver-2.3.4-universal
streetsidesoftware.code-spell-checker-4.0.34
tobermory.es6-string-html-2.17.0
unifiedjs.vscode-mdx-1.8.14-universal
usernamehw.remove-empty-lines-1.0.1
vmsynkov.colonize-2.2.2
vsls-contrib.gistfs-0.6.0
vue.volar-2.0.8
vue.volar-3.0.0-universal
vue.volar-3.0.1-universal
wallabyjs.console-ninja-1.0.382
wordpresstoolbox.wordpress-toolbox-1.3.16
zignd.html-css-class-completion-1.20.0