aaron-bond.better-comments
christian-kohler.npm-intellisense
codeium.codeium
codium.codium
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
ecmel.vscode-html-css
edwinhuish.better-comments-next
esbenp.prettier-vscode
figma.figma-vscode-extension
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.github-vscode-theme
github.remotehub
github.vscode-pull-request-github
humao.rest-client
johnpapa.vscode-peacock
josee9988.minifyall
mechatroner.rainbow-csv
monish.regexsnippets
monokai.theme-monokai-pro-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.remote-repositories
oouo-diogo-perdigao.docthis
postman.postman-for-vscode
redhat.vscode-xml
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
shopify.theme-check-vscode
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
tabnine.tabnine-vscode
vmsynkov.colonize
vscode-icons-team.vscode-icons
vsls-contrib.gistfs
vue.volar
wallabyjs.console-ninja
wallabyjs.quokka-vscode
