aslamanver.vsc-export
burkeholland.simple-react-snippets
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer-2
dbaeumer.jshint
dbaeumer.vscode-eslint
donjayamanne.githistory
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
GraphQL.vscode-graphql
HookyQR.beautify
josee9988.minifyall
mgmcdermott.vscode-language-babel
mikestead.dotenv
ms-dotnettools.csharp
naumovs.color-highlight
oderwat.indent-rainbow
ritwickdey.LiveServer
sdras.night-owl
shd101wyy.markdown-preview-enhanced
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
VisualStudioExptTeam.vscodeintellicode
vmsynkov.colonize
wesbos.theme-cobalt2
