aaron-bond.better-comments
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
deque-systems.vscode-axe-linter
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
GraphQL.vscode-graphql-syntax
josee9988.minifyall
oderwat.indent-rainbow
richie5um2.vscode-sort-json
ritwickdey.LiveServer
shd101wyy.markdown-preview-enhanced
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
vmsynkov.colonize
vsls-contrib.gistfs
wesbos.theme-cobalt2
